# yolo11_custom.yaml
task: detect
nc: 1

scales:
  n: [0.50, 0.25, 1024]  # Depth=1, Width=0.50

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C3k2, [256, True]]     # 2-P2 특징
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 3, C3k2, [512, True]]     # 4-P3 특징
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 3, C3k2, [512, True]]     # 6-P4 특징
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C3k2, [1024, True]]    # 8-P5 특징
  - [-1, 1, SPPF, [1024, 5]]       # 9
  - [-1, 2, C2PSA, [1024]]         # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11 (P5->P4)
  - [[-1, 6], 1, Concat, [1]]                  # 12 (cat P4)
  - [-1, 3, C3k2, [512, False]]                # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14 (P4->P3)
  - [[-1, 4], 1, Concat, [1]]                  # 15 (cat P3)
  - [-1, 3, C3k2, [256, False]]                # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17 (P3->P2)
  - [[-1, 2], 1, Concat, [1]]                  # 18 (cat P2)
  - [-1, 3, C3k2, [256, False]]                # 19 (P2 Head)

  # [핵심] 10(P5), 13(P4), 16(P3), 19(P2)를 연결
  - [[19, 16, 13, 10], 1, Detect, [nc]]        # 20